Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeToposolidFromVerticalFaceError
Can't make toposolid from vertical face.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeToposolidFromVerticalFace
Can't make toposolid from vertical face.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawToposolidError
Can't make toposolid.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawToposolid
Can't make toposolid.